# Estadística univariada y control de flujo

In [1]:
import pandas as pd

In [2]:
# solicitemos las primeras filas del archivo alumnos (desde bash)
!head alumnos.csv

nombre,altura,peso,edad,sexo
Hugo,1.67,60,23,h
Paco,1.73,83,25,h
Luis,1.62,70,28,h
Diana,1.58,58,21,m
Francisco,1.86,98,28,h
Felipe,1.79,100,26,h
Jacinta,1.69,62,20,m
Bernardo,1.6,83,31,h
Marisol,1.6,56,30,m

In [3]:
df = pd.read_csv('alumnos.csv')

In [4]:
df.head()

      nombre  altura  peso  edad sexo
0       Hugo    1.67    60    23    h
1       Paco    1.73    83    25    h
2       Luis    1.62    70    28    h
3      Diana    1.58    58    21    m
4  Francisco    1.86    98    28    h

In [5]:
df.shape

(21, 5)

In [6]:
df[:5]

      nombre  altura  peso  edad sexo
0       Hugo    1.67    60    23    h
1       Paco    1.73    83    25    h
2       Luis    1.62    70    28    h
3      Diana    1.58    58    21    m
4  Francisco    1.86    98    28    h

In [7]:
df[15:]

       nombre  altura  peso  edad sexo
15  Alejandra    1.86    74    21    m
16   Fernando    1.79    93    27    h
17   Carolina    1.60    63    28    m
18    Vicente    1.98   102    31    h
19   Benjamín    1.72    78    36    h
20     Gloria    1.58    65    23    m

In [8]:
df[5:10]

     nombre  altura  peso  edad sexo
5    Felipe    1.79   100    26    h
6   Jacinta    1.69    62    20    m
7  Bernardo    1.60    83    31    h
8   Marisol    1.60    56    30    m
9   Facundo    1.98   112    36    h

In [9]:
df['altura']

0     1.67
1     1.73
2     1.62
3     1.58
4     1.86
5     1.79
6     1.69
7     1.60
8     1.60
9     1.98
10    1.72
11    1.63
12    1.73
13    1.62
14    1.58
15    1.86
16    1.79
17    1.60
18    1.98
19    1.72
20    1.58
Name: altura, dtype: float64

In [10]:
altura = df['altura']
type(altura)

pandas.core.series.Series

In [11]:
altura[15:]

15    1.86
16    1.79
17    1.60
18    1.98
19    1.72
20    1.58
Name: altura, dtype: float64

In [12]:
altura[:16]

0     1.67
1     1.73
2     1.62
3     1.58
4     1.86
5     1.79
6     1.69
7     1.60
8     1.60
9     1.98
10    1.72
11    1.63
12    1.73
13    1.62
14    1.58
15    1.86
Name: altura, dtype: float64

# Estadística Univariada

In [14]:
sum(altura) / len(altura)

1.7109523809523806

In [15]:
import numpy as np
np.mean(altura)

1.7109523809523806

In [16]:
import scipy.stats as stats
stats.mode(altura)

ModeResult(mode=array([1.58]), count=array([3]))

In [17]:
np.median(altura)

1.69

In [18]:
print(np.percentile(altura,50))
print(np.percentile(altura,75))
print(np.percentile(altura,90))

1.69
1.79
1.86

In [19]:
np.ptp(altura)

/home/cristian/anaconda3/lib/python3.7/site-packages/numpy/core/fromnumeric.py:2389: FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
  return ptp(axis=axis, out=out, **kwargs)

0.3999999999999999

In [20]:
altura.max() - altura.min()

0.3999999999999999

In [21]:
np.var(df['altura'])

0.015056235827664391

In [22]:
np.std(altura)

0.12270385416792902

In [24]:
# para cada i en nuestra base de datos
for i in df:
    # imprime la representación de i
    print(i)
print("\nColumnas: ", df.columns)

nombre
altura
peso
edad
sexo

Columnas:  Index(['nombre', 'altura', 'peso', 'edad', 'sexo'], dtype='object')

In [25]:
for i in df['peso']:
    if i % 2 == 0:
        print(i ** 2)

3600
4900
3364
9604
10000
3844
3136
12544
5184
4624
6084
5476
10404
6084

In [27]:
for i in df['peso']:
    print(i.index)

AttributeError: 'int' object has no attribute 'index'

In [28]:
# generamos una lista vacía
peso_cuadrado = []
# para cada uno de los valores en df['peso']
for i in df['peso']:
    # lo elevamos al cuadrado y posteriormente concatenamos al final de la lista
    peso_cuadrado.append(i ** 2)
# una vez terminado el proceso, convertimos la lista a una serie
peso_cuadrado = pd.Series(peso_cuadrado)

In [29]:
peso_cuadrado

0      3600
1      6889
2      4900
3      3364
4      9604
5     10000
6      3844
7      6889
8      3136
9     12544
10     5184
11     3249
12     4624
13     6084
14     4489
15     5476
16     8649
17     3969
18    10404
19     6084
20     4225
dtype: int64

In [30]:
# esta nueva variable tendrá cada valor elevado al cuadrado
peso_cuadrado_vect = df['peso'] ** 2
# evaluamos si es que cada elemento es igual
peso_cuadrado == peso_cuadrado_vect

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
dtype: bool

In [31]:
peso_cuadrado

0      3600
1      6889
2      4900
3      3364
4      9604
5     10000
6      3844
7      6889
8      3136
9     12544
10     5184
11     3249
12     4624
13     6084
14     4489
15     5476
16     8649
17     3969
18    10404
19     6084
20     4225
dtype: int64

In [32]:
for rowname, rowserie in df.iterrows():
    print(type(rowserie))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [33]:
# evaluamos el primer iterable, ignorando el segundo con _
for colname, _ in df.iteritems():
    print(colname)

nombre
altura
peso
edad
sexo

In [34]:
# consultamos por la
for colname, colserie in df.iteritems():
    print(f"Tipo de dato de {colname}: {colserie.dtype}")

Tipo de dato de nombre: object
Tipo de dato de altura: float64
Tipo de dato de peso: int64
Tipo de dato de edad: int64
Tipo de dato de sexo: object

In [35]:
df['sexo'] == 'h'

0      True
1      True
2      True
3     False
4      True
5      True
6     False
7      True
8     False
9      True
10    False
11    False
12    False
13     True
14     True
15    False
16     True
17    False
18     True
19     True
20    False
Name: sexo, dtype: bool

In [36]:
edad_hombres = df[df['sexo'] == 'h']
edad_hombres

       nombre  altura  peso  edad sexo
0        Hugo    1.67    60    23    h
1        Paco    1.73    83    25    h
2        Luis    1.62    70    28    h
4   Francisco    1.86    98    28    h
5      Felipe    1.79   100    26    h
7    Bernardo    1.60    83    31    h
9     Facundo    1.98   112    36    h
13      Diego    1.62    78    23    h
14    Gonzalo    1.58    67    22    h
16   Fernando    1.79    93    27    h
18    Vicente    1.98   102    31    h
19   Benjamín    1.72    78    36    h

In [37]:
edad_mujeres = df[df['sexo'] != 'h']
edad_mujeres

       nombre  altura  peso  edad sexo
3       Diana    1.58    58    21    m
6     Jacinta    1.69    62    20    m
8     Marisol    1.60    56    30    m
10   Trinidad    1.72    72    21    m
11     Camila    1.63    57    26    m
12   Macarena    1.73    68    27    m
15  Alejandra    1.86    74    21    m
17   Carolina    1.60    63    28    m
20     Gloria    1.58    65    23    m

In [38]:
print("La edad promedio para Hombres es: ", np.mean(edad_hombres['edad']))
print("La edad promedio para Mujeres es: ", np.mean(edad_mujeres['edad']))

La edad promedio para Hombres es:  28.0
La edad promedio para Mujeres es:  24.11111111111111

In [40]:
# iniciamos el contador
count_female = 0
# para cada elemento de df['sexo']
for i in df['sexo']:
    # si es mujer
    if i == 'm':
        # sumamos 1 al contador
        count_female += 1
count_female

9

In [41]:
len(df[df['sexo'] == 'm'])

9

In [43]:
# iniciamos el contador
contador_mujeres_bajo_peso = 0
# para cada posición y registro
for i, r in df.iterrows():
    # si el registro cumple con la condición menor a la media
    if (r['altura'] < df['altura'].mean()):
        # Y si éste es mujer
        if r['sexo'] == 'm':
            # sumamos 1
            contador_mujeres_bajo_peso += 1
contador_mujeres_bajo_peso

6